Repository: Pitxi/ClassCreator
Catalog: translations/*.po
Languages: es

source: Angle brackets
es: Comillas angulares

source: Double quotes
es: Dobles comillas

source: Public
es: Público

source: Protected
es: Protegido

source: Private
es: Privado

source: Class name:
es: Nombre de la clase:

source: Namespace:
es: Espacio de nombres:

source: Clear text.
es: Borrar texto.

source: File to be included
es: Fichero a incluir

source: Delimiter
es: Delimitador

source: Adds a new include to the class.
es: Añade una nueva línea de inclusión a la clase.

source: Add
es: Añadir

source: Removes the selected include.
es: Elimina la línea de inclusión seleccionada.

source: Remove
es: Eliminar

source: Includes
es: Inclusiones

source: Base class name
es: Nombre de clase base

source: Inheritance type
es: Tipo de herencia

source: Base classes
es: Clases base

source: Class header file
es: Fichero de cabecera de la clase

source: Select file name and location to save.
es: Selecciona nombre de fichero y localización para guardar.

source: Class header file:
es: Fichero de cabecera de la clase:

source: Class source file:
es: Fichero fuente de la clase:

source: Class source file
es: Fichero fuente de la clase

source: Author:
es: Autor:

source: Copyright holder:
es: Titular de los derechos de copia:

source: Date format:
es: Formato de fecha:

source: License info:
es: Información de licencia:

source: Include class documentation.
es: Incluir documentación de la clase.

source: Load default value.
es: Cargar valor por defecto.

source: Header extension:
es: Extensión del fichero de cabecera:

source: Source extension:
es: Extensión del fichero fuente:

source: Introduction
es: Introducción

source: Class info
es: Información de la clase.

source: Documentation
es: Documentación

source: Confirmation
es: Confirmación

source: New C++ Class information
es: Información de la nueva clase C++

source: Choose a name and location for the header file...
es: Escoja un nombre y una localización para el fichero de cabecera...

source: C++ header files
es: Ficheros de cabecera C++

source: C++ source files
es: Ficheros fuente C++

source: All files
es: Todos los ficheros

source: Choose a name and location for the source file...
es: Escoja un nombre y una localización para el fichero fuente...

source: Select
es: Seleccionar

source: Cancel
es: Cancelar

source: Confirm the new C++ Class files creation
es: Confirmar la creación de los ficheros de la nueva clase C++

source: Example
es: Ejemplo

source: Class documentation info
es: Información para la documentación de la clase

source: %1 is a small tool conceived as a wizard to aid in creating new clases for C++ projects.
es: %1 es una pequeña herramienta concebida como un asistente para ayudar en la creación de nuevas clases para proyectos C++.

source: Javier Campón Pichardo (english and spanish)
es: Javier Campón Pichardo (inglés y español)

source: GitHub project site
es: Sitio del proyecto en GitHub

source: Create a new C++ class
es: Crear una nueva clase C++

source: The %1 tool will assist you in the creation of a new C++ class by generating the needed source and header files with the provided information. In this page you also can set the %1 preferences by clicking on the preferences button. Press Continue to start or Cancel to exit.
es: La herramienta %1 le asistirá en la creación de una nueva clase C++ generando los ficheros de cabecera y fuente necesarios a partir de la información proveída. Puse Continuar para comenzar o Cancelar para salir.

source: _Preferences
es: _Preferencias

source: _About %1...
es: _Acerca de %1...

source: Preferences
es: Preferencias
